chapter_04/placeDefaultOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.samples" xmlns:xsd="http://services.samples/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:placeOrder>
            <ser:order>
                <xsd:price>1.4</xsd:price>
                <xsd:symbol>WSO2</xsd:symbol>
            </ser:order>
        </ser:placeOrder>
    </soapenv:Body>
</soapenv:Envelope>